title: Detects Base64 encoded Shellcode
id: 3d18d7b2-3348-4f68-a748-7b0f4c4430d9
status: experimental
description: Detects Base64 encoded Shellcode
references:
  - https://twitter.com/cyb3rops/status/1063072865992523776
tags:
  - attack.execution
  - attack.t1059
  - car.2014-04-003
author: David Ledbetter (shellcode), Florian Roth (rule)
date: 2018-11-17
logsource:
  category: Microsoft-Windows-PowerShell/Operational
  product: PowerShell
detection:
  selection:
    EventID: '4104'
    Data.ScriptBlockText:
      - '*AAAAYInlM*'
      - '*OiCAAAAYInlM*'
      - '*OiJAAAAYInlM*'
  condition: selection
fields:
  - EventID
  - Data.ScriptBlockText
falsepositives:
  - False positives may occur due to legitimate Base64 encoded data being present in PowerShell scripts.
level: high